# git - ПО для контроля версий
# github - вебсервис для git репозиториев

# git clone "ССЫЛКА_НА_РЕПОЗИТОРИЙ" - клонирование репозитория на локальную машину (наш пк)
# git commit -m "КОММЕНТАРИИ_СОХРАНЕНИЯ" - сохранение изменений
# git add . -  сохранение бэкапа
# git push origin "НАЗВАГИЕ_ВЕТКИ" - отправка наших изменений на сервер github
# git pull origin "НАЗВАНИЕ_ВЕТКИ" - стягивание изменений из какой-либо ветки
# git branch "НАЗВАНИЕ_ВЕТКИ" - создание новой ветки
# git checkout "НАЗВАНИЕ_ВЕТКИ" - переход в другую ветку
# git branch -d " ИМЯ ВЕТКИ" - удаляет ветку(локально)
# git branch -D " ИМЯ ВЕТКИ" - удаляет ветку(глобально)
# git fetch --all - стягивает все ветки(синхронизирует)
# git push origin -d additional - удаление ветки с репозитория
# fix - исправить ошибку
# feat - новая фишка
# refactor - поправка кода
# style - исправления стиля
# test - добавление тестов
# схема: fix: little_fix_in_calc
